
[rule]
author = ["Liane Mulvaney"]
description = "Triggers when more than 1000 queries to a web server have been observed in a 5 min window"
from = "now-6m" # this is the default value, change as needed
name = "Exessive Web Traffic"
risk_score = 25
severity = "low"
type = "threshold"
rule_id = "0002"
query = '''
event.dataset: zeek.http
'''


[[rule.threat]] 
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1046"
name = "Network Service Discovery"
reference = "https://attack.mitre.org/techniques/T1046/"

[rule.threat.tactic]
id = "TA0007"
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"

[rule.threshold]
field = ["source.ip"]
value = 1000
